## Data Manipulation

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("../data/course_participants.xlsx")
df

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

## Index

In [9]:
df.index.name = "user_id"
df

         user_id   name  age  country  score continent
user_id
0           1001   Mark   55    Italy    4.5    Europe
1           1000   John   33      USA    6.7   America
2           1002    Tim   41      USA    3.9   America
3           1003  Jenny   12  Germany    9.0    Europe

## Selecting Data by label

In [21]:
# Select 1 value - Scalar
df.loc[0, "name"]

'Mark'

In [23]:
# Select 2 values - Series
df.loc[[0, 2], "age"]

user_id
0    55
2    41
Name: age, dtype: int64

In [26]:
# Select 1 column - Series
df.loc[:, "country"]

user_id
0      Italy
1        USA
2        USA
3    Germany
Name: country, dtype: object

In [30]:
# Select 1 row - Series
df.loc[1, :]

user_id         1000
name            John
age               33
country          USA
score            6.7
continent    America
Name: 1, dtype: object

In [25]:
# Select 1 column in an array - DataFrame
df.loc[:, ["country"]]

         country
user_id
0          Italy
1            USA
2            USA
3        Germany

In [33]:
# Select 1 row in an array - DataFrame
df.loc[[1], :]

         user_id  name  age country  score continent
user_id
1           1000  John   33     USA    6.7   America

In [27]:
# Select multiple columns - DataFrame
df.loc[:, ["name", "country"]]

          name  country
user_id
0         Mark    Italy
1         John      USA
2          Tim      USA
3        Jenny  Germany

In [29]:
# Select range of columns - DataFrame
df.loc[:, "name":"country"]

          name  age  country
user_id
0         Mark   55    Italy
1         John   33      USA
2          Tim   41      USA
3        Jenny   12  Germany

## Selecting Data by label

In [36]:
# Select 1 value - Scalar
df.iloc[0, 1]

'Mark'